# LightGroupManager Properties

---
The LightGroupManager type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
LightGroupManager Class
Autodesk.Revit.DB.Lighting Namespace